{"config": [{"config": {"gamma_regularizer": null, "beta_regularizer": null, "dtype": "float32", "epsilon": 0.001, "name": "batch_normalization_1", "axis": -1, "scale": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "center": true, "batch_input_shape": [null, 96, 96, 1], "beta_constraint": null, "gamma_constraint": null, "momentum": 0.99, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true}, "class_name": "BatchNormalization"}, {"config": {"bias_regularizer": null, "dilation_rate": [1, 1], "bias_constraint": null, "dtype": "float32", "filters": 24, "name": "conv2d_1", "strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last", "kernel_initializer": {"config": {"mode": "fan_in", "scale": 2.0, "seed": null, "distribution": "normal"}, "class_name": "VarianceScaling"}, "use_bias": true, "padding": "same", "kernel_size": [5, 5], "kernel_constraint": null, "activity_regularizer": null, "activation": "linear", "kernel_regularizer": null, "batch_input_shape": [null, 96, 96, 1], "trainable": true}, "class_name": "Conv2D"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_1"}, "class_name": "Activation"}, {"config": {"padding": "valid", "pool_size": [2, 2], "trainable": true, "name": "max_pooling2d_1", "strides": [2, 2], "data_format": "channels_last"}, "class_name": "MaxPooling2D"}, {"config": {"bias_regularizer": null, "dilation_rate": [1, 1], "bias_constraint": null, "trainable": true, "filters": 36, "name": "conv2d_2", "strides": [1, 1], "kernel_regularizer": null, "data_format": "channels_last", "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "use_bias": true, "padding": "valid", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [5, 5], "activity_regularizer": null, "activation": "linear", "kernel_constraint": null}, "class_name": "Conv2D"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_2"}, "class_name": "Activation"}, {"config": {"padding": "valid", "pool_size": [2, 2], "trainable": true, "name": "max_pooling2d_2", "strides": [2, 2], "data_format": "channels_last"}, "class_name": "MaxPooling2D"}, {"config": {"bias_regularizer": null, "dilation_rate": [1, 1], "bias_constraint": null, "trainable": true, "filters": 48, "name": "conv2d_3", "strides": [1, 1], "kernel_regularizer": null, "data_format": "channels_last", "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "use_bias": true, "padding": "valid", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [5, 5], "activity_regularizer": null, "activation": "linear", "kernel_constraint": null}, "class_name": "Conv2D"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_3"}, "class_name": "Activation"}, {"config": {"padding": "valid", "pool_size": [2, 2], "trainable": true, "name": "max_pooling2d_3", "strides": [2, 2], "data_format": "channels_last"}, "class_name": "MaxPooling2D"}, {"config": {"bias_regularizer": null, "dilation_rate": [1, 1], "bias_constraint": null, "trainable": true, "filters": 64, "name": "conv2d_4", "strides": [1, 1], "kernel_regularizer": null, "data_format": "channels_last", "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "use_bias": true, "padding": "valid", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [3, 3], "activity_regularizer": null, "activation": "linear", "kernel_constraint": null}, "class_name": "Conv2D"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_4"}, "class_name": "Activation"}, {"config": {"padding": "valid", "pool_size": [2, 2], "trainable": true, "name": "max_pooling2d_4", "strides": [2, 2], "data_format": "channels_last"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"units": 500, "bias_constraint": null, "trainable": true, "name": "dense_1", "kernel_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "activation": "linear", "kernel_regularizer": null}, "class_name": "Dense"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_5"}, "class_name": "Activation"}, {"config": {"units": 90, "bias_constraint": null, "trainable": true, "name": "dense_2", "kernel_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "activation": "linear", "kernel_regularizer": null}, "class_name": "Dense"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_6"}, "class_name": "Activation"}, {"config": {"units": 30, "bias_constraint": null, "trainable": true, "name": "dense_3", "kernel_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "activation": "linear", "kernel_regularizer": null}, "class_name": "Dense"}], "keras_version": "2.0.4", "class_name": "Sequential", "backend": "tensorflow"}